import { LongDialog } from "../homepage/ข่าวประชาสัมพันธ์/DialogDefault";
import { MiniMarKet } from "../homepage/ข่าวประชาสัมพันธ์/MiniMarket";
import { EvaluateStandards } from "../homepage/ข่าวประชาสัมพันธ์/EvaluateStandards";
import { OneTeam } from "../homepage/ข่าวประชาสัมพันธ์/OneTeam";
import { ProfessionalSkillsCompetition } from "../homepage/ข่าวประชาสัมพันธ์/ProfessionalSkillsCompetition";
import { HotelProfessionalSkillsCompetition } from "../homepage/ข่าวประชาสัมพันธ์/HotelProfessionalSkillsCompetition";
import { MeetTheLongJourney } from "../homepage/ข่าวประชาสัมพันธ์/MeetTheLongJourney";
import { BoyScoutOpenCamp } from "../homepage/ข่าวประชาสัมพันธ์/BoyScoutOpenCamp";
import { OpeningSpeechBoyScout } from "../homepage/ข่าวประชาสัมพันธ์/OpeningSpeechBoyScout";
import { ColorThreeBar } from "../homepage/ข่าวประชาสัมพันธ์/ColorThreeBar";
import { OpenTheScoutTroop } from "../homepage/ข่าวประชาสัมพันธ์/OpenTheScoutTroop";
import { CeremonyToPresentTheRoyalMonumentToKingRamaVI } from "../homepage/ข่าวประชาสัมพันธ์/CeremonyToPresentTheRoyalMonumentToKingRamaVI";
import { EnterTheAcademicBase } from "../homepage/ข่าวประชาสัมพันธ์/EnterTheAcademicBase";
import { MoraleTestingBase } from "@components/homepage/ข่าวประชาสัมพันธ์/MoraleTestingBase";
import { ActivitiesAroundTheBonfire } from "@components/homepage/ข่าวประชาสัมพันธ์/ActivitiesAroundTheBonfire";
import { MakeMeritByGivingAlmsToMonks } from "@components/homepage/ข่าวประชาสัมพันธ์/MakeMeritByGivingAlmsToMonks";
import { InventionsOfTheNewGeneration } from "@components/homepage/ข่าวประชาสัมพันธ์/InventionsOfTheNewGeneration";
import { LoyKratong } from "@components/homepage/ข่าวประชาสัมพันธ์/LoyKratong";
import { Congratulate } from "../homepage/ข่าวประชาสัมพันธ์/Congratulate";
import { TwoCongratulations } from "../homepage/ข่าวประชาสัมพันธ์/TwoCongratulations";
import { ATP } from "../homepage/ข่าวประชาสัมพันธ์/ATP";
import { VolunteerScout } from "../homepage/ข่าวประชาสัมพันธ์/VolunteerScout";
import { GraduationPhoto } from "../homepage/ข่าวประชาสัมพันธ์/GraduationPhoto";
import { DeathAnniversary } from "../homepage/ข่าวประชาสัมพันธ์/DeathAnniversary";
import { EnterFurtherEducation } from "../homepage/ข่าวประชาสัมพันธ์/EnterFurtherEducation";
import { HisMajestyTheKingsBirthday } from "../homepage/ข่าวประชาสัมพันธ์/HisMajestyTheKing'sBirthday";
import { BloodDonation } from "../homepage/ข่าวประชาสัมพันธ์/BloodDonation";
import { AttendTheMeeting } from "../homepage/ข่าวประชาสัมพันธ์/AttendTheMeeting";
import { CheckStudents } from "../homepage/ข่าวประชาสัมพันธ์/CheckStudents";
import { RunAndCatchTheMist } from "../homepage/ข่าวประชาสัมพันธ์/RunAndCatchTheMist";
import { Inventions } from "../homepage/ข่าวประชาสัมพันธ์/Inventions";
import { Glove } from "../homepage/ข่าวประชาสัมพันธ์/Glove";
import { Patient } from "../homepage/ข่าวประชาสัมพันธ์/Patient";
import { ThaiSakSongContest } from "../homepage/ข่าวประชาสัมพันธ์/ThaiSakSongContest";
import { CityPillarShrineWorshipCeremony } from "../homepage/ข่าวประชาสัมพันธ์/CityPillarShrineWorshipCeremony";
import { GiveTeamShirts } from "../homepage/ข่าวประชาสัมพันธ์/GiveTeamShirts";
import { Contest } from "../homepage/ข่าวประชาสัมพันธ์/Contest";
import { InstallationTraining } from "../homepage/ข่าวประชาสัมพันธ์/InstallationTraining";
import { Christmas } from "../homepage/ข่าวประชาสัมพันธ์/Christmas";
import { Congratulations } from "../homepage/ข่าวประชาสัมพันธ์/Congratulations";
import { GiveAdvice } from "../homepage/ข่าวประชาสัมพันธ์/GiveAdvice";
import { ChristmasDay1 } from "../homepage/ข่าวประชาสัมพันธ์/ChristmasDay1";
import { ChristmasDay2 } from "../homepage/ข่าวประชาสัมพันธ์/ChristmasDay2";
import { ChristmasDay3 } from "../homepage/ข่าวประชาสัมพันธ์/ChristmasDay3";
import { QuotaRound1 } from "../homepage/ข่าวประชาสัมพันธ์/QuotaRound1";
import { HappNewYour2024 } from "../homepage/ข่าวประชาสัมพันธ์/HappNewYour2024";
import { MrThursday } from "../homepage/ข่าวประชาสัมพันธ์/MrThursday";
import { BasicSkillsCompetition } from "../homepage/ข่าวประชาสัมพันธ์/BasicSkillsCompetition";
import { VNET } from "../homepage/ข่าวประชาสัมพันธ์/VNET";
import { GivingFreshEggs } from "../homepage/ข่าวประชาสัมพันธ์/GivingFreshEggs";
import { QuotaRoundone } from "../homepage/ข่าวประชาสัมพันธ์/QuotaRoundone";
import {
  Congratulations1,
  Congratulations2,
  Surrender,
} from "../homepage/ข่าวประชาสัมพันธ์/Congratulations1";
import {
  VideoMedia,
  VideoMedia1,
  VideoMedia2,
  VideoMedia3,
  VideoMedia4,
  VideoMedia5,
  VideoMedia6,
  VideoMedia7,
  VideoMedia8,
} from "../homepage/ข่าวประชาสัมพันธ์/VideoMedia";

import a1 from "@assets/ข่าวประชาสัมพันธ์/01/04.jpg";
import b1 from "@assets/ข่าวประชาสัมพันธ์/02/1.jpg";
import c3 from "@assets/ข่าวประชาสัมพันธ์/03/3.jpg";
import img4 from "@assets/ข่าวประชาสัมพันธ์/04/16.jpg";
import img5 from "@assets/ข่าวประชาสัมพันธ์/05/4.jpg";
import img6 from "@assets/ข่าวประชาสัมพันธ์/06/9.jpg";
import img7 from "@assets/ข่าวประชาสัมพันธ์/07/1.jpg";
import img8 from "@assets/ข่าวประชาสัมพันธ์/08/1.jpg";
import img9 from "@assets/ข่าวประชาสัมพันธ์/09/1.jpg";
import img10 from "@assets/ข่าวประชาสัมพันธ์/10/1.jpg";
import img11 from "@assets/ข่าวประชาสัมพันธ์/11/1.jpg";
import img12 from "@assets/ข่าวประชาสัมพันธ์/12/1.jpg";
import img13 from "@assets/ข่าวประชาสัมพันธ์/13/1.jpg";
import img14 from "@assets/ข่าวประชาสัมพันธ์/14/1.jpg";
import img15 from "@assets/ข่าวประชาสัมพันธ์/15/1.jpg";
import img16 from "@assets/ข่าวประชาสัมพันธ์/16/1.jpg";
import img17 from "@assets/ข่าวประชาสัมพันธ์/17/1.jpg";
import img18 from "@assets/ข่าวประชาสัมพันธ์/18/gif.gif";
import img19 from "@assets/ข่าวประชาสัมพันธ์/18/3.png";
import img20 from "@assets/ข่าวประชาสัมพันธ์/19/1.jpg";
import img21 from "@assets/ข่าวประชาสัมพันธ์/20/1.jpg";
import img22 from "@assets/ข่าวประชาสัมพันธ์/21/1.jpg";
import img23 from "@assets/ข่าวประชาสัมพันธ์/รูปจบการศึกษา/1.jpg";
import img24 from "@assets/ข่าวประชาสัมพันธ์/22/1.jpg";
import img25 from "@assets/ข่าวประชาสัมพันธ์/ศึกษาต่อในระดับอุดมศึกษา/1.jpg";
import img26 from "@assets/ข่าวประชาสัมพันธ์/วันคล้ายวันพระบรมราชสมภพ/1.jpg";
import img27 from "@assets/ข่าวประชาสัมพันธ์/บริจาคโลหิตเพื่อช่วยชีวิตเพื่อนมนุษย์/1.jpg";
import img28 from "@assets/ข่าวประชาสัมพันธ์/เข้าร่วมประชุมคณะทำงานการขับเคลื่อนพัฒนากำลังแรงงานรองอุตสาหกรรมยานยนต์ไฟฟ้า/1.jpg";
import img29 from "@assets/ข่าวประชาสัมพันธ์/ตรวจนักเรียน/1.jpg";
import img30 from "@assets/ข่าวประชาสัมพันธ์/วิ่งคว้าหมอก/1.jpg";
import img31 from "@assets/ข่าวประชาสัมพันธ์/งาน/1.jpg";
import img32 from "@assets/ข่าวประชาสัมพันธ์/ถุงมือ/Artboard.png";
import img33 from "@assets/ข่าวประชาสัมพันธ์/ผู้ป่วย/Artboard.png";
import img34 from "@assets/ข่าวประชาสัมพันธ์/23/2.jpg";
import img35 from "@assets/ข่าวประชาสัมพันธ์/24/10.jpg";
import img36 from "@assets/ข่าวประชาสัมพันธ์/25/09.jpg";
import img37 from "@assets/ข่าวประชาสัมพันธ์/26/1.jpg";
import img38 from "@assets/ข่าวประชาสัมพันธ์/27/12.jpg";
import img39 from "@assets/ข่าวประชาสัมพันธ์/Christmas/414695255_2773267582825763_1711551872989877101_n.jpg";
import img40 from "@assets/ข่าวประชาสัมพันธ์/28/1.jpg";
import img41 from "@assets/ข่าวประชาสัมพันธ์/29/01.jpg";
import img42 from "@assets/ข่าวประชาสัมพันธ์/30/25.jpg";
import img43 from "@assets/ข่าวประชาสัมพันธ์/31/07.jpg";
import img44 from "@assets/ข่าวประชาสัมพันธ์/32/13.jpg";
import img45 from "@assets/ข่าวประชาสัมพันธ์/33/3.jpg";
import img46 from "@assets/ข่าวประชาสัมพันธ์/33/5.jpg";
import img47 from "@assets/ข่าวประชาสัมพันธ์/34/1.jpg";
import img48 from "@assets/ข่าวประชาสัมพันธ์/35/3.png";
import img49 from "@assets/ข่าวประชาสัมพันธ์/36/1.png";
import img50 from "@assets/ข่าวประชาสัมพันธ์/37/01.jpg";
import img51 from "@assets/ข่าวประชาสัมพันธ์/38/1.jpg";
import img52 from "@assets/ข่าวประชาสัมพันธ์/39/1.jpg";
import img53 from "@assets/ข่าวประชาสัมพันธ์/39/2.gif";
import img54 from "@assets/ข่าวประชาสัมพันธ์/39/3.gif";
import img55 from "@assets/ข่าวประชาสัมพันธ์/39/4.gif";
import img56 from "@assets/ข่าวประชาสัมพันธ์/39/5.gif";
import img57 from "@assets/ข่าวประชาสัมพันธ์/39/6.gif";
import img58 from "@assets/ข่าวประชาสัมพันธ์/40/05.jpg";
import img59 from "@assets/ข่าวประชาสัมพันธ์/41/1.jpg";
import img60 from "@assets/ข่าวประชาสัมพันธ์/41/1.gif";
import img61 from "@assets/error.png";
import img62 from "@assets/error.png";
import img63 from "@assets/ข่าวประชาสัมพันธ์/41/2.jpg";
import img64 from "@assets/ข่าวประชาสัมพันธ์/42/01.jpg";
import img65 from "@assets/ข่าวประชาสัมพันธ์/43/22.jpg";
import img66 from "@assets/ข่าวประชาสัมพันธ์/44/1.1.jpg";
import img67 from "@assets/ข่าวประชาสัมพันธ์/44/6.jpg";
import img68 from "@assets/ข่าวประชาสัมพันธ์/45/1.jpg";

import { Worship } from "../homepage/ข่าวประชาสัมพันธ์/Worship";
import { SurrenderStudent } from "../homepage/ข่าวประชาสัมพันธ์/SurrenderStudent";
import { KingVajiraklao } from "../homepage/ข่าวประชาสัมพันธ์/KingVajiraklao";
import { ProfessionalStandards } from "../homepage/ข่าวประชาสัมพันธ์/ProfessionalStandards";
import { Business } from "../homepage/ข่าวประชาสัมพันธ์/Business";

export const DataPressRelease = [
  {
    name: `วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img68,
    review: `ขอประชาสัมพันธ์ ตามศูนย์บ่มเพาะผู้ประกอบการอาชีวศึกษา...`,
    url: <Business />,
  },
  {
    name: `ระชุมเชิงปฏิบัติการชี้แจงหลักเกณฑ์`,
    backgroundImage: img67,
    review: `และวิธีการประเมินมาตรฐานวิชาชีพตามหลักสูตรประกาศนียบัตร...`,
    url: <ProfessionalStandards />,
  },
  {
    name: `พระบาทสมเด็จพระปรเมนทรรามาธิบดีศรีสินทรมหาวชิราลงกรณ์
    พระวชิรเกล้าเจ้าอยู่หัว พระราชทานพระบรมราโชวาท
    สำหรับลงพิมพ์ในหนังสือวันเด็กแห่งชาติปี ๒๕๖๗`,
    backgroundImage: img66,
    review: ` `,
    url: <KingVajiraklao />,
  },
  {
    name: `พบกับบรรยากาศการเข้ามอบตัวนักเรียน `,
    backgroundImage: img65,
    review: `นักศึกษา ในโควตา รอบที่ 1 ของ...`,
    url: <SurrenderStudent />,
  },
  {
    name: `เช้าวันที่ 10 มกราคม 2567`,
    backgroundImage: img64,
    review: ` วิทยาลัยเทคนิคกันทรลักษ์ สักการบูชา องค์พระวิษณุกรรม...`,
    url: <Worship />,
  },
  {
    name: `วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img63,
    review: `ยินดีต้อนรับ ผู้ปกครอง เเละนักเรียน-นักศึกษา...`,
    url: <Surrender />,
  },
  {
    name: `เชิญชวนน้องๆมาเรียนการตลาดเยอะๆนะคะ`,
    backgroundImage: img62,
    review: `อย่าพึ่งด่วนตัดสินใจเลยคะ เเวะมาฟังพี่ก่อนนะ ❤️ ...`,
    url: <VideoMedia8 />,
  },
  {
    name: `เข้ามาเป็นครอบครัวเดียวกันกับแผนกการตลาด `,
    backgroundImage: img61,
    review: `วิทยาลัยเทคนิคกันทร์ลักษ์ กันนะคะ✍️🏫📚...`,
    url: <VideoMedia7 />,
  },
  {
    name: `ผลงานการประกวดทำสื่อวิดีทัศน์`,
    backgroundImage: img60,
    review: `ในการนำเสนอประชาสัมพันธ์วิทยาลัยเทคนิคกันทรลักษ์ ปีการศึกษา 2567...`,
    url: <VideoMedia6 />,
  },
  {
    name: `วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img59,
    review: ` ขอเเสดงความยินดีกับ ดร.นิติ นาชิต ที่ปรึกษาด้านมาตรฐานอาชีวศึกษาธุรกิจเเละบริการ...`,
    url: <Congratulations2 />,
  },
  {
    name: `วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img58,
    review: `ขอเเสดงความยินดีกับรางวัล กิจกรรมประกวดทำสื่อวิดีทัศน์ในการนำเสนอ...`,
    url: <VideoMedia5 />,
  },
  {
    name: `ผลงานการประกวดทำสื่อวิดีทัศน์`,
    backgroundImage: img57,
    review: `ในการนำเสนอประชาสัมพันธ์วิทยาลัยเทคนิคกันทรลักษ์...`,
    url: <VideoMedia4 />,
  },
  {
    name: `ผลงานการประกวดทำสื่อวิดีทัศน์`,
    backgroundImage: img56,
    review: `ในการนำเสนอประชาสัมพันธ์วิทยาลัยเทคนิคกันทรลักษ์...`,
    url: <VideoMedia3 />,
  },
  {
    name: ` ผลงานการประกวดทำสื่อวิดีทัศน์`,
    backgroundImage: img55,
    review: `ในการนำเสนอประชาสัมพันธ์วิทยาลัยเทคนิคกันทรลักษ์...`,
    url: <VideoMedia2 />,
  },
  {
    name: `ผลงานการประกวดทำสื่อวิดีทัศน์`,
    backgroundImage: img54,
    review: `ในการนำเสนอประชาสัมพันธ์วิทยาลัยเทคนิคกันทรลักษ์...`,
    url: <VideoMedia1 />,
  },
  {
    name: `ผลงานการประกวดทำสื่อวิดีทัศน์`,
    backgroundImage: img53,
    review: `ในการนำเสนอประชาสัมพันธ์วิทยาลัยเทคนิคกันทรลักษ์...`,
    url: <VideoMedia />,
  },
  {
    name: `วิทยาลัยเทคนิคกันทร์`,
    backgroundImage: img52,
    review: `ใขอส่งต่อผลผลิตที่ยิ่งใหญ่ 
    "ขอเเสดงความยินดีเป็นอย่างยิ่งกับ" นายภาสวุฒิ ป้อมหิน...`,
    url: <Congratulations1 />,
  },
  {
    name: `ประกาศ ❗️โอกาสกลับมาอีกครั้ง`,
    backgroundImage: img51,
    review: `ใครที่สมัครรอบโควตารอบที่ 1 ไม่ทัน ถ้าพึ่งเสียใจไป😍 วิทยาลัยเทคนิคกันทรลักษ์...`,
    url: <QuotaRoundone />,
  },
  {
    name: `วันศุกร์ที่ 5 มกราคม 2567`,
    backgroundImage: img50,
    review: `นางสาวทักษิณา ชมจันทร์ ผู้อำนวยการวิทยาลัยเทคนิคกันทรลักษ์...`,
    url: <GivingFreshEggs />,
  },
  {
    name: `ประกาศรายชื่อผู้ที่มีสิทธิ์สอบ V-NET`,
    backgroundImage: img49,
    review: ``,
    url: <VNET />,
  },
  {
    name: `วิทยาลัยเทคนิคกันทรลักษ์ #เทคนิคกันทร์`,
    backgroundImage: img48,
    review: `ขอเเสดงความยินดีกับ การเเข่งขันทักษะพื้นฐาน...`,
    url: <BasicSkillsCompetition />,
  },
  {
    name: `วันที่ 2 มกราคม 2567 วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img47,
    review: ` "ยินดีต้อนรับ"
    นายพฤหัสบดี ผลวิสุทธิ์ เนื่องในโอกาสบรรจุ เเละ...`,
    url: <MrThursday />,
  },
  {
    name: ` วิทยาลัยเทคนิคกันทรลักษ์ สวัสดีปีใหม่ ๒๕๖๗`,
    backgroundImage: img46,
    review: `ในวารดิถีขึ้นปีใหม่ ขออำนาจสิ่งศักดิ์สิทธิ์ดลบัลดาลให้ท่านได้...`,
    url: <HappNewYour2024 />,
  },
  {
    name: ` ประกาศรายชื่อผู้ที่มีสิทธิ์เข้าศึกษาต่อ (โควตารอบ1)`,
    backgroundImage: img45,
    review: `ละดับ ปวช. เเละ ปวส. ปีการศึกษา 2567 วิทยาลัยเทคนิคกันทรลักษ์...`,
    url: <QuotaRound1 />,
  },
  {
    name: `( Set 3) เทศกาลเเห่งความสุขกลับมาอีกครั้ง `,
    backgroundImage: img44,
    review: `เมื่อวันที่ 27 ธันวาคม 2566  วิทยาลัยเทคนิคกันทรลักษ์ได้จัด...`,
    url: <ChristmasDay3 />,
  },
  {
    name: `( Set 2) เทศกาลเเห่งความสุขกลับมาอีกครั้ง `,
    backgroundImage: img43,
    review: `เมื่อวันที่ 27 ธันวาคม 2566  วิทยาลัยเทคนิคกันทรลักษ์ได้จัด...`,
    url: <ChristmasDay2 />,
  },
  {
    name: `( Set 1) เทศกาลเเห่งความสุขกลับมาอีกครั้ง `,
    backgroundImage: img42,
    review: `เมื่อวันที่ 27 ธันวาคม 2566  วิทยาลัยเทคนิคกันทรลักษ์ได้จัด...`,
    url: <ChristmasDay1 />,
  },
  {
    name: `วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img41,
    review: `ขอยินดีตอนรับ นายสุริยา สามเเก้ว ครูวิทยาลัยเทคนิคเดชอุดม ที่...`,
    url: <GiveAdvice />,
  },
  {
    name: `วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img40,
    review: `ขอเเสดงความยินดีกับผู้ที่รับได้รางวัลการประกวด/ประเมินสิ่งประดิษฐ์ของคนรุ่นใหม่ ระดับอาชีวศึกษาจังหวัดศรีสะเกษ ...`,
    url: <Congratulations />,
  },
  {
    name: `  `,
    backgroundImage: img39,
    review: `Sending the warmest Christmas wishes to you and your family. 
    May God shower his choicest blessings on you and your family this Christmas🎄🎉🎁`,
    url: <Christmas />,
  },
  {
    name: `วิทยาลัยเทคนิคกันทรลักษ์ `,
    backgroundImage: img38,
    review: ` คณะครู นักเรียนนักศึกษา ได้เข้ารับการอบรมการติดตั้งระบบประจุไฟฟ้า 
    ณ จังหวัดอุบลราชธานี`,
    url: <InstallationTraining />,
  },
  {
    name: `วิทยาลัยเทคนิคกันทรลักษ์ `,
    backgroundImage: img37,
    review: `ของเเสดงความยินดีกับที่ผู้ได้รับรางรัล เเละผู้ที่ได้เข้าร่วมกิจกรรม การประกวด... `,
    url: <Contest />,
  },
  {
    name: `ขอแสดวความยินดีกับ นายต้นนที สีเทา มชอ.21 `,
    backgroundImage: img34,
    review: `ได้ส่งมอบเสื้อทีม KTLTC One team เข้าร่วมเเข่งขันทักษวิชาชีพ... `,
    url: <ThaiSakSongContest />,
  },
  {
    name: ` วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img36,
    review: `ประจำปี 2566 วันที่ 14 ธันวาคม 2566 `,
    url: <GiveTeamShirts />,
  },
  {
    name: `พิธีบวงสรวงศาลหหลักเมืองกันทรลักษ์`,
    backgroundImage: img35,
    review: `ประจำปี 2566 วันที่ 14 ธันวาคม 2566 `,
    url: <CityPillarShrineWorshipCeremony />,
  },
  {
    name: `ขอแสดวความยินดีกับ แผนกวิชาคอมพิวเตอร์ธุรกิจ`,
    backgroundImage: img33,
    review: `การประกวดสิ่งประดิษฐ์ของคนรุ่นใหม่ `,
    url: <Patient />,
  },
  {
    name: `ขอแสดวความยินดีกับ แผนกวิชาคอมพิวเตอร์ธุรกิจ`,
    backgroundImage: img32,
    review: `การประกวดสิ่งประดิษฐ์ของคนรุ่นใหม่ `,
    url: <Glove />,
  },
  {
    name: `การประกวดสิ่งประดิษฐ์ของคนรุ่นใหม่`,
    backgroundImage: img31,
    review: ` วิทยาลัยเทคนิคกันทรลักษ์.... `,
    url: <Inventions />,
  },
  {
    name: `ภาพบรรยากาศยามเช้าของ วันที่ 10 ธันวาคม 2566  `,
    backgroundImage: img30,
    review: ` #เทคนิคกันทร์ เข้าร่วมกิจกรรม “วิ่งคว้าหมอก หยอกตะวัน MO E-DANG RUN 2023”`,
    url: <RunAndCatchTheMist />,
  },
  {
    name: `นางสาวทักษิณา  ชมจันทร์ ผู้อำนวยการวิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img29,
    review: `นำ นายสมศักดิ์ จันทานิตย์ รองผู้อำนวยการ ฝ่ายพัฒนากิจการนักเรียนนักศึกษา และคณะครูที่ปรึกษา เข้าตรวจนักเรียน นักศึกษา ที่มาพร้อมกับสายรถรับส่ง  `,
    url: <CheckStudents />,
  },
  {
    name: `นาางสาวภวิกา  โพธิ์ขาว รองผู้อำนวยการฝ่ายวิชาการ`,
    backgroundImage: img28,
    review: `เข้าร่วมประชุมคณะทำงานการขับเคลื่อนพัฒนากำลังแรงงานรองอุตสาหกรรมยานยนต์ไฟฟ้า ครั้งที่ 1/2566 `,
    url: <AttendTheMeeting />,
  },
  {
    name: `วิทยาลัยเทคนิคกันทรลักษ์ #เทคนิคกันทร์ คณะผู้บริหาร ครู บุคลากร เเละนักเรียน นักศึกษา ได้เข้าร่วม`,
    backgroundImage: img27,
    review: `บริจาคโลหิต เพื่อช่วยชีวิตเพื่อนมนุษย์ `,
    url: <BloodDonation />,
  },
  {
    name: `วันคล้ายวันพระบรมราชสมภพ พระบาทสมเด็จพระบรมชนกาธิเบศร
    มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร `,
    backgroundImage: img26,
    review: ` `,
    url: <HisMajestyTheKingsBirthday />,
  },
  {
    name: `ขอเเสดงความยินดีเป็นอย่างยิ่งกับ `,
    backgroundImage: img25,
    review: `นักเรียนนักศึกษา วิทยาลัยเทคนิคกันทรลักษ์ ทุกๆคน`,
    url: <EnterFurtherEducation />,
  },
  {
    name: `๑ ธันวาคม ๒๕๖ `,
    backgroundImage: img24,
    review: `เป็นวันคล้ายวันสิ้นพระชนม์ ของพลเอกสมเด็จพระเจ้าบรมวงค์เธอ กรมพระยาดำรงราชานุภาพ`,
    url: <DeathAnniversary />,
  },
  {
    name: `รูปถ่ายรับปริญญา `,
    backgroundImage: img23,
    review: `มาเเจกบรรยากาศที่เต็มไปด้วย ความรัก อบอุ่น กับนักเรียน นักศึกษา
    เป็นที่ภาคภูมิใจของ คณะผู้บริหาร คุณครู เทคนิคกันทร์`,
    url: <GraduationPhoto />,
  },
  {
    name: `ลูกเสือจิตอาสา `,
    backgroundImage: img22,
    review: `โดย กองลูกเสือวิสามัญ วิทยาลัยกันทรลักษ์ #เทคนิคกันทร์ เเละผู้กำกับ `,
    url: <VolunteerScout />,
  },
  {
    name: `โครงการพัฒนาศักยภาพสู่ความสำเร็จ `,
    backgroundImage: img21,
    review: `นักเรียน นักศึกษา #เทคนิคกันทร์ ได้เข้าฟังการบรรยายจาก ATP โครงการพัฒนาศักยภาพสู่ความสำเร็จ`,
    url: <ATP />,
  },
  {
    name: `ขอเเสดงความยินดี `,
    backgroundImage: img20,
    review: `กับทีมผู้ชนะการประกวดสิ่งประดิษฐ์ของคนรุ่นใหม่ ระดับสถานศึกษา ประจำปี ๒๕๖๖`,
    url: <TwoCongratulations />,
  },
  {
    name: `🔸ขอเเสดงความยินดี เเละชื่นชม 🔸 `,
    backgroundImage: img19,
    review: `1.นางสาวสุชาดา นุจตุรัส บริหารธุรกิจ เทคโนโลยีธุรกิจดิจิทัล 
    2.นางสาวสุรีพร ทองทิพย์ บริหารธุรกิจ การบัญชี`,
    url: <Congratulate />,
  },
  {
    name: `🔸สุขสันต์วันลอยกระทง🔸 `,
    backgroundImage: img18,
    review: `ภาพบรรยายกาศ การจัดกิจกรรมการประกวดสิ่งประดิษฐ์ของคนรุ่นใหม่ ระดับสถานศึกษา เพื่อส่งประกวดต่อในระดับจังหวัดศรีสะเกษ`,
    url: <LoyKratong />,
  },
  {
    name: `กิจกรรมการประกวดสิ่งประดิษฐ์ของคนรุ่นใหม่ `,
    backgroundImage: img17,
    review: `ภาพบรรยายกาศ การจัดกิจกรรมการประกวดสิ่งประดิษฐ์ของคนรุ่นใหม่ ระดับสถานศึกษา เพื่อส่งประกวดต่อในระดับจังหวัดศรีสะเกษ`,
    url: <InventionsOfTheNewGeneration />,
  },
  {
    name: `กิจกรรมทำบุญตักบาตร วันครบรอบ ๑๑ ปี `,
    backgroundImage: img16,
    review: `ในวันที่ ๒๑ พฤศจิกายน ๒๕๖๖
    ณ โดมอเนกประสงค์วิทยาลัยเทคนิคกันทรลักษ์`,
    url: <MakeMeritByGivingAlmsToMonks />,
  },
  {
    name: `กิจกรรมรอบกองไฟ`,
    backgroundImage: img15,
    review: `กิจกรรมสำคัญของการเข้าค่ายลูกเสือที่ขาดไม่ได้ คือ กิจกรรมรอบกองไฟ🔥#เทคนิคกันทร์
    ณ วันที่ 18 พฤศจิกายน 2566 `,
    url: <ActivitiesAroundTheBonfire />,
  },
  {
    name: `กิจกรรมเข้าฐานวิชาการ เเละฐานทดสอบกำลังใจ `,
    backgroundImage: img14,
    review: `มาชมบรรยากาศความน่ารัก ความคุข ตบก เฮฮา ในการเข้าฐานผจญภัย กับเหล่าผู้กำกับ ลูกเสือ `,
    url: <MoraleTestingBase />,
  },
  {
    name: `กิจกรรมเข้าฐานวิชาการ เเละฐานทดสอบกำลังใจ `,
    backgroundImage: img13,
    review: `นำโดย นายสมศักดิ์ จันทานิตย์ ผู้กำกับ ครู บุคลากร  วิทยาลัยเทคนิคกันทรลักษ์`,
    url: <EnterTheAcademicBase />,
  },
  {
    name: `พิธีถวายราชสดุดีพระบรมราชานุสรณ์ รัชการที่ 6 `,
    backgroundImage: img12,
    review: `นำโดย นางสาวทักษิณา ชมจันทร์ ผู้อำนวยการวิทยาลัยเทคนิคกันทรลักษ์`,
    url: <CeremonyToPresentTheRoyalMonumentToKingRamaVI />,
  },
  {
    name: `กล่าวเปิดกองลูกเสือ `,
    backgroundImage: img11,
    review: `นางสาวทักษิณา ชมจันทร์ ผู้อำนวยการวิทยาลัยเทคนิคกันทรลักษ์ กล่าวเปิดกองลูกเสือ เเละให้โอวาทเเก่ลูกเสือทุกนาย`,
    url: <OpenTheScoutTroop />,
  },
  {
    name: `กิจกรรม ประดับแถบ 3 สี  `,
    backgroundImage: img10,
    review: `คณะผู้บริหารครูบุคลากร วิทยาลัยเทคนิคกันทรลักษ์ ขอให้สิ่งศักดิ์สิทธ์จงปกปักคุ้มครองลูกเสือทุกนายให้ผ่านพ้นไปด้วยดี `,
    url: <ColorThreeBar />,
  },
  {
    name: ` นายสมศักดิ์ จันทานิตย์ รองผู้อำนวยการ กล่าวเปิดกอง ลูกเสือ `,
    backgroundImage: img9,
    review: `นายสมศักดิ์ จันทานิตย์ รองผู้อำนวยการ ฝ่านพัฒนากิจการนักเรียนนักศึกษา ในการกล่าวเปิดกอง ลูกเสือ `,
    url: <OpeningSpeechBoyScout />,
  },
  {
    name: `ลูกเสือได้การเดินทางไกลผจญภัย`,
    backgroundImage: img8,
    review: `ลูกเสือ เเละผู้กำกับทุกนาย ได้เริ่มเข้าสู่ค่ายลูกเสืออย่างเป็นทางการ  เเละเตรียมที่พักอาศัย`,
    url: <BoyScoutOpenCamp />,
  },
  {
    name: `เทคนิคกันทร์ พบกับการเดินทางไกล`,
    backgroundImage: img7,
    review: `พบกับการเดินทางไกลของ🐯🐯กลุ่มลูกเสือ ที่ต้องผจญภัยเก็บดวงดาวตามจุดต่าง ๆ ให้ครบ 🐯🐯`,
    url: <MeetTheLongJourney />,
  },
  {
    name: `คณะผู้บริหาร วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img6,
    review: `กล่าวเปิดการเเข่งขันทักษะวิชาชีพ สาขาวิชาการโรงเเรม ระดับ ปวช. ปวช เเละเยี่ยมชมนักเรียน นักศึกษา ในการเเข่งขัน`,
    url: <HotelProfessionalSkillsCompetition />,
  },
  {
    name: `คณะผู้บริหาร วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img5,
    review: `กล่าวเปิดการเเข่งขันทักษะวิชาชีพ สาขาวิชาช่างก่อสร้าง สาขาวิชาโยธา เเละเยี่ยมชมนักเรียน นักศึกษา ในการเเข่งขัน`,
    url: <ProfessionalSkillsCompetition />,
  },
  {
    name: `คณะผู้บริหาร วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: img4,
    review: `เข้าร่วมงานประชุมวิชาการองค์การนักวิชาชีพในอนาคตเเห่งประเทศไทย ระดับจังหวัดศรีสะเกษ ครั้งที่ 33 `,
    url: <OneTeam />,
  },
  {
    name: `วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: a1,
    review: `เข้าร่วมประชุมการแข่งขันทักษะวิชาชีพ. 7 พฤศจิกายน 2566`,
    url: <LongDialog />,
  },
  {
    name: `ตลาดมินิ วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: b1,
    review: `ห้ามพลาด สาขางานการตลาด ขอเชิญชวน นักเรียน-นักศึกษา บุลลากร ไปเที่ยวชม ชิม อุดหนุน ช็อป ได้ที่ตลาดมินิ  `,
    url: <MiniMarKet />,
  },
  {
    name: ` วิทยาลัยเทคนิคกันทรลักษ์`,
    backgroundImage: c3,
    review: `ได้รับการประเมินองค์การมาตรฐานดีเด่น เเละสมาชิกดีเด่น โครงการภายใต้การนิเทศ ระดับจังหวัดศรีสะเกษ ประจำปีการศึกษา 2566 ที่วิทยาลัยเทคนิคศรีสะเกษ `,
    url: <EvaluateStandards />,
  },

  // {
  //   icon: RxReader,
  //   name: `admin`,
  //   backgroundImage: img1,
  //   review: `กรุณาเเพิ่มข้อมูล`,
  // },
];
