import React from "react";
import {
  Button,
  Dialog,
  DialogBody,
  DialogFooter,
} from "@material-tailwind/react";

import { Typography } from "@material-tailwind/react";
import { Data36 } from "@components/database/Database";

export function Contest() {
  const [open, setOpen] = React.useState(false);

  const handleOpen = () => setOpen(!open);

  return (
    <>
      <button onClick={handleOpen}>ดูข้อมูลเพิ่มเติม</button>
      <Dialog open={open} handler={handleOpen}>
        <DialogBody className="h-[36rem] overflow-scroll mt-2  ">
          <Typography className=" ">
            <>
              <div className="text-xl text-center">
                วิทยาลัยเทคนิคกันทรลักษ์
              </div>
              <p className="text-xs">
                ของเเสดงความยินดีกับที่ผู้ได้รับรางรัล
                เเละผู้ที่ได้เข้าร่วมกิจกรรม
                การประกวด/ประเมินสิ่งประดิษฐ์ของคนรุ่นใหม่
                ระดับอาชีวศึกษาจังหวัดศรีสะเกษ ประจำปีการศึกษา 2566
                โดยวิทยาลัยเทคนิคกันทรลักษ์ ได้รับรางวัล 🥇รางวัลชนะเลิศ จำนวน 3
                รายการ <br />
                🥈รางวัลรองชนะเลิศอันดับ 1 จำนวน ดังนี้ <br />
                ประเภทที่ 1 สิ่งประดิษฐ์ด้านนวัตกรรมและเทคโนโลยีการเกษตร
                อุตสาหกรรมสมัยใหม่
                <br />
                1 เครื่องวัดความอ่อน-แก่ทุเรียน
                <br />
                รางวัลชนะเลิศ เหรียญทอง
                <br />
                ครูที่ปรึกษา
                <br />
                1. นางสาวคำโฮม คูณสว่าง ครู <br />
                2. นางสาววิภาวรรณ สีแดด รองผู้อำนวยการ <br />
                3. นางวีนัส สุวรรณ ครู <br />
                4. นายกิตติ ผลดี ครูพิเศษสอน <br />
                ผู้ประดิษฐ์ <br />
                5. นางสาวสุทธญาณ์ ย่อมพันธ์ นักศึกษา <br />
                6. นางสาวภัชราวดี ศรีโวหะ นักศึกษา <br />
                7. นายอภิสิทธิ์ มะโนชาติ นักศึกษา <br />
                8. นางสาวพัชราภา พุฒเทศ นักศึกษา <br />
                9. นายบุญเลิศ โภคพันธ์ นักศึกษา <br />
                10. นางสาวนันท์นภัส สถาพร นักศึกษา <br />
                11. นางสาวจารุวรรณ สายปัญญา นักศึกษา <br />
                12. นางสาวสุปราณี วงค์เสน่ห์ นักศึกษา <br />
                ประเภทที่2 สิ่งประดิษฐ์ด้านนวัตกรรมและเทคโนโลยีดิจิทัล
                ปัญญาประดิษฐ์
                <br />
                2 อุปกรณ์ช่วยเหลือผู้ป่วยติดเตียง
                <br />
                รางวัลชนะเลิศ เหรียญเงิน
                <br />
                ครูที่ปรึกษา
                <br />
                1. นายณัทพงศ์ โยธี ครู <br />
                2. นายสิริปัญญ์ เสริมสิริพิพัฒน์ ครู <br />
                3. นายชินาธิป พรมชา พนักงานราชการครู <br />
                4. นางกิ่งดาว บุญประสิทธิ พนักงานราชการ ครู <br />
                5. นางสาวจิราวรรณ ชอบดี ครูพิเศษสอน <br />
                ผู้ประดิษฐ์ <br />
                6. นายนิติธร จินดาบุตร นักศึกษา <br />
                7. นางสาวกนวรรณ ไชยวัฒน์ นักศึกษา <br />
                8. นายเทพสุทิน ทองอ่อน นักศึกษา <br />
                9. นายทวิ ปัญชาติ นักศึกษา <br />
                10. นายวุฒิไกร ผิวขาว นักศึกษา <br />
                ประเภทที่ 5 สิ่งประดิษฐ์ด้านนวัตกรรมและเทคโนโลยีเพื่อสุขภาพ
                (HEALTH CARE)
                <br />
                4. ถุงมือประคบบรรเทาอาการปวดประจำเดือน
                <br />
                รางวัลชนะเลิศ เหรียญเงิน
                <br />
                ครูที่ปรึกษา
                <br />
                1. นางสาวปวีณา บุญเสนอ ครูพิเศษสอน <br />
                2. นางกิ่งดาว บุญประสิทธิ์ พนักงานราชการ ครู <br />
                3. นายประดิษฐ ใจทรง พนักงานราชการ ครู <br />
                4. นายวิทยา ลัทธิมนต์ ครูพิเศษสอน <br />
                5. นางสาวจิราวรรณ ชอบดี. ครูพิเศษสอน <br />
                ผู้ประดิษฐ์ <br />
                6. นางสาวพนิตา คูณโปก นักศึกษา <br />
                7. นางสาวพิมพ์ชนก สุวรรณ นักศึกษา <br />
                8. นางสาวพรรณราย เจริญศรี นักศึกษา <br />
                9. นางสาวฐิติมา บุญเสนอ นักศึกษา <br />
                ประเภทที่ 5 สิ่งประดิษฐ์ด้านนวัตกรรมและเทคโนโลยีเพื่อสุขภาพ
                (HEALTH CARE)
                <br />
                3. ไรซ์เบอรี่กาแฟ
                <br />
                รางวัลรองชนะเลิศอันดับ1 เหรียญเงิน
                <br />
                ครูที่ปรึกษา
                <br />
                1. นางสาวฐิติชญา ภิบาลวงษ์ ครูพิเศษสอน <br />
                2. นางวีนัส สุวรรณ ครู <br />
                3. นางนงลักษณ์ ศรีชา ครู <br />
                4. นางสาวสุธิดา เกษี ครูพิเศษสอน <br />
                5. นายธนัญชัย สิงห์อุดม ครูพิเศษสอน
                <br />
                ผู้ประดิษฐ์ <br />
                6. นายณัฏฐ์พัชยา เลื่อนฤทธิ์ นักศึกษา <br />
                7. นางสาวปพิชญา สร้อยทอง นักศึกษา <br />
                8. นางสาวจรรยารัตน์ พิทักษ์ นักศึกษา <br />
                9. นายวิชญ์พล อินทุพันธ์ นักศึกษา <br />
                10. นางสาวบัณฑิตา จันทมั่น นักศึกษา <br />
                11. นางสาวเสาวลักษ์ กฤษณ์ณ์ดนัย นักศึกษา <br />
                12. นางสาวสุชาดี ไชยบุญเรือง นักศึกษา <br />
                13. นางสาววิภาดา คันทา นักศึกษา <br />
                14. นางสาวกิตตินันท์ คำภาชีพ นักศึกษา <br />
                15. นายเอกภักดิ์ รัตนะ นักศึกษา <br />
                วิทยาลัยเทคนิคกันทรลักษ์ ขอให้นักเรียน -
                นักศึกษาทุกคนประสบผลสำเร็จ{" "}
              </p>
              <div className="justify-center flex-col ">
                <div>
                  {Data36.map((Data36) => (
                    <div className="mb-4 group relative shadow-lg rounded-xl px-[144px] py-[144px]  ">
                      <div
                        className="absolute inset-0 bg-cover bg-center rounded-xl hover:scale-110 transition duration-500 cursor-pointer object-cover"
                        style={{
                          backgroundImage: `url(${Data36.img36})`,
                        }}
                      />
                    </div>
                  ))}
                </div>
              </div>
            </>
          </Typography>
        </DialogBody>
        <DialogFooter>
          <Button variant="text" color="blue-gray" onClick={handleOpen}>
            ย้อนกลับ
          </Button>
        </DialogFooter>
      </Dialog>
    </>
  );
}
