import React from "react";
import {
  Button,
  Dialog,
  DialogBody,
  DialogFooter,
} from "@material-tailwind/react";

import { Typography } from "@material-tailwind/react";
import { Data61 } from "@components/database/Database";

export function TeachersDay() {
  const [open, setOpen] = React.useState(false);

  const handleOpen = () => setOpen(!open);

  return (
    <>
      <button onClick={handleOpen}>ดูข้อมูลเพิ่มเติม</button>
      <Dialog open={open} handler={handleOpen}>
        <DialogBody className="h-[36rem] overflow-scroll mt-2  ">
          <Typography className=" ">
            <>
              <div className="text-xl text-center">
                วิทยาลัยเทคนิคกันทรลักษ์
              </div>
              <p className="text-xs">
                ขอเเสดงความยินดีอย่างยิ่ง กับคณะผู้บริหารสถานศึกษา ครู
                เเละบุคลากรทางการศึกษา ได้รับเกียรติบัตรเชิดชูเกียรติ
                "วันครูอาชีวศึกษา" ประจำปีการศึกษา ๒๕๖๗ ทั้งนี้
                ได้รับเกรียติจากประธาน ดร. ณัฐวิชญ์ ศิริรัชฎานันท์
                มอบเกียรติบัตรเชิดชูเกียรติในครั้งนี้ ขอเเสดงความยินดีกับ
                <br />
                👉นางสาวทักษิณา ชมจันทร์ ผู้อำนวยการวิทยาลัยเทคนิคกันทรลักษ์{" "}
                <br />
                👉นายอาทร ศรีมะณี รองผู้อำนวยการฝ่ายบริหารทรัพยากร
                <br />
                👉นายสมศักดิ์ จันทานิตย์ รองผู้อำนวยการฝ่ายพัฒนากิจการนักเรียน
                นักศึกษา
                <br />
                👉นางสาวภวิกา โพธิ์ขาว รองผู้อำนวยการฝ่ายวิชาการ
                <br />
                👉นางสาววิภาวรรณ สีเเดด รองผู้อำนวยการฝ่ายเเผนงานเเละความร่วมมือ
                ได้รับเกียรติบัตรเชิดชูเกียรติ “วันครูอาชีวศึกษา” ประจำปี ๒๕๖๗
                รางวัลผู้บริหารดีเด่น พร้อมด้วย ครู เเละ บุคลากร
                วิทยาลัยเทคนิคกันทรลักษ์ ได้รับรางวัล
                บุคลากรที่ปฏิบัติหน้าที่ดีเด่น
                เเละบุคลากรผู้มีคุณธรรมและจริยธรรม ดังรายชื่อต่อไปนี้
                <br />
                นายบุญแต่ง ป้อมหิน
                <br />
                นางสาวณัฐสินี ชวดพงษ์
                <br />
                นางสาวคำโฮม คูณสว่าง
                <br />
                นางสาวทราทิตย์ ชิดชม
                <br />
                นางธนิตา สมนิยาม
                <br />
                นายกิตติ ผลดี
                <br />
                นายสุประวัติ ขันทอง
                <br />
                นางสาวกนกพร พวงศรี
                <br />
                นางภัชรานันท์ จันทชิด
                <br />
                นางวันทนา วิศรีสิทธิ์
                <br />
                นางสาววันดี ปานฟัก
                <br />
                นางศิริรัตน์ คำเพราะ
                <br />
                นางสุลัดดา ยอดกุล
                <br />
                นางศริญญา ผาแก้ว
                <br />
                นางนงลักษณ์ ศรีชา
                <br />
                นางสาวฐิติชญา ภิบาลวงษ์
                <br />
                นายณัทพงษ์ โยธี
                <br />
                นายชินาธิป พรมชา
                <br />
                นายวิทยา ลัทธิมนต์
                <br />
                นายสาวปวีณา บุญเสนอ
                <br />
                นางสาวจิราวรรณ ชอบดี
                <br />
                นางสาวณัตติยา หล่อวินิจนันท์
                <br />
                นางเพ็ชรา โหม่งมาตร์
                <br />
                นายสุวรรณ บุษภาค
                <br />
                นายสันติ ไชยประดิษฐ์
                <br />
                นายเอกวัฒน์ ใจมั่น
                <br />
                นายจักรกฤษณ์ พันธ์ศรี
                <br />
                นายสมาน คำขาว
                <br />
                ว่าที่ร้อยเอกสายชล ทองแป
                <br />
                นายศักดิ์นรินทร์ ประชา
                <br />
                นายทรงพร พรหมโสภา
                <br />
                นายอภินันท์ อนุสินธุ์
                <br />
                นายชาตรี ศรีสะอาด
                <br />
                นายภูดิศ สุวรรณวงค์
                <br />
                นายมานะศักดิ์ อารมณ์สวะ
                <br />
                นายบุญญฤทธิ์ แสงทอง
                <br />
                นายธีระ ศรีมาบุตร
                <br />
                นายคัคเนศวร์ โกมลศรี
                <br />
                นายประสิทธิ์ จันพูล
                <br />
                นายบุญจันทร์ โตมร
                <br />
                นายศิริศักดิ์ จันพูล
                <br />
                นายอุทัย จรรยากรณ์
                <br />
                นายไกรศร ผิวผัน
                <br />
                นายสุขสันต์ สิทธิมวล
                <br />
                นายประดิษฐ ใจทรง
                <br />
                จ่าสิบเอกชาติชาย ฝอยทอง
                <br />
                นายจิรพันธ์ สำเภา
                <br />
                นางสาวน้อย จันทร์พูล
                <br />
                นางสาววิมลรัตน์ โททอง
                <br />
                นางสาวภัคสุรีย์รัช ศีลให้อยู่สุข
                <br />
                นางสาวรุ่งทิวา ปานแก้ว
                <br />
                นางสาวกชพรรณ ปะเพระตา
                <br />
                นางสาววิไลลักษณ์ เคนคำบ้ง
                <br />
                นางสาวเมธิญา วรรณจู
                <br />
                นายภานุวัฒน์ สุขชาติ
                <br />
                นายวิรัช ศรีเลิศ
                <br />
                นาง แดง กันเทพา
                <br />
                วันอังคารที่ ๑๖ มกราคม ๒๕๖๗ <br />
              </p>
              <div className="justify-center flex-col ">
                <div>
                  {Data61.map((Data61) => (
                    <div className="mb-4 group relative shadow-lg rounded-xl px-[200px] py-[200px]  ">
                      <div
                        className="absolute inset-0 bg-cover bg-center rounded-xl hover:scale-110 transition duration-500 cursor-pointer object-cover"
                        style={{
                          backgroundImage: `url(${Data61.img61})`,
                        }}
                      />
                    </div>
                  ))}
                </div>
              </div>
            </>
          </Typography>
        </DialogBody>
        <DialogFooter>
          <Button variant="text" color="blue-gray" onClick={handleOpen}>
            ย้อนกลับ
          </Button>
        </DialogFooter>
      </Dialog>
    </>
  );
}
