import React from "react";
import {
  Button,
  Dialog,
  DialogBody,
  DialogFooter,
} from "@material-tailwind/react";

import { Typography } from "@material-tailwind/react";
import { Data19 } from "@components/database/Database";

export function TwoCongratulations() {
  const [open, setOpen] = React.useState(false);

  const handleOpen = () => setOpen(!open);

  return (
    <>
      <div className=" ">
        <button onClick={handleOpen}>ดูข้อมูลเพิ่มเติม</button>
        <Dialog open={open} handler={handleOpen}>
          <DialogBody className="h-[36rem] overflow-scroll mt-2">
            <Typography className="font-normal">
              <>
                <div className="text-xl text-center">
                  ขอเเสดงความยินดี เเละชื่นชม
                </div>
                <p className="text-xs">
                  บรรยากาศเช้า วันพุธที่ ๒๙ พฤศติกายน ๒๕๖๖
                  ขอเเสดงความยินดีกับทีมผู้ชนะการประกวดสิ่งประดิษฐ์ของคนรุ่นใหม่
                  ระดับสถานศึกษา ประจำปี ๒๕๖๖ ได้รับเกียรติ นางสาวทักษิณา
                  ชมจันทร์ ผู้อำนวยการวิทยาลัยเทคนิคกันทรลักษ์
                  มอบเงินทุนการศึกษา เเละเกียรติบัตร ให้เเก่ผู้ได้รับรางวัล
                  <br />
                  🥇ชนะเลิศ สิ่งประดิษฐ์ประเภทที่ ๑
                  เครื่องวัดความอ่อน-แก่ของทุเรียน KTL-TC01 ครูที่ปรึกษา
                  นางสาวคำโฮม คูณสว่าง หัวหน้าทีม นายอภิสิทธิ์ มะโนชาติ
                  <br />
                  🥈รองชนะเลิศอันดับ ๑ สิ่งประดิษฐ์ประเภทที่ ๒
                  เครื่องกดน้ำเย็นอัจฉริยะครูที่ปรึกษา นายประสิทธิ์ จันพูล
                  หัวหน้าทีม นางสาวสุทญาณ์ ย่อมพันธ์
                  <br />
                  🥉รองชนะเลิศอันดับ ๒ สิ่งประดิษฐ์ประเภทที่ ๔ ตูเล่จิ้งหรีด
                  ครูที่ปรึกษา นายวิทยา ลัทธิมนต์ หัวหน้าทีม นางสาววราภรณ์
                  ไชยโคตร
                  <br />
                  ชมเชยที่ ๑ สิ่งประดิษฐ์ประเภทที่ ๕ ถุงมือประคบ
                  บรรเทาอาการปวดประจำเดือน ครูที่ปรึกษา นางสาวปวีณา บุญเสนอ
                  หัวหน้าทีม นางสาวพนิดา คุณโปก
                  <br />
                  ชมเชยที่ ๒ สิ่งประดิษฐ์ประเภทที่ ๒ เครื่องให้อาหารปลาอัจฉริยะ
                  ครูที่ปรึกษา นายเอกวัฒน์ ใจมั่น หัวหน้าทีม นายเตชภัทร
                  โพธิ์อุดม
                  <br />
                  ชมเชยที่ ๓ สิ่งประดิษฐ์ประเภทที่ ๖ หัวไขควงสำหรับสว่าน Diy
                  ครูที่ปรึกษา นายธีระ ศรีมาบุตร หัวหน้าทีม นายภัทรพล ศรีชื่น
                  <br />
                  ชมเชยที่ ๔ สิ่งประดิษฐ์ประเภทที่ ๕ ไรซ์เบอรี่กาแฟ ครูที่ปรึกษา
                  นางสาวฐิติชญา ภิบาลวงษ์ หัวหน้าทีม นางสาวภัทรวดี เครือมาศ
                  <br />
                  ชมเชยที่ ๕ สิ่งประดิษฐ์ประเภทที่ ๖ เครื่องกดไฮดรอลิกแบบโยก
                  ครูที่ปรึกษา นายจักรกฤษณ์ พันธ์ศรี หัวหน้าทีม นายนพรัตน์ อรชร
                  <br />
                  ชมเชยที่ ๖ สิ่งประดิษฐ์ประเภทที่ ๔ เเยลลี่กาแฟภูเขาไฟ
                  ครูที่ปรึกษา นางวันทนา วิศรีสิทธิ์ หัวหน้าทีม นายเจษฎา
                  คลังภูเขียว
                  <br />
                  ชมเชยที่ ๗ สิ่งประดิษฐ์ประเภทที่ ๒ อุปกรณ์ช่วยเหลือเด็กพิการ
                  ครูที่ปรึกษา นายณัทพงศ์ โยธี หัวหน้าทีม นายเทพสุทิน ทองอ่อน
                  <br />
                  ชมเชยที่ ๘ สิ่งประดิษฐ์ประเภทที่ ๓ ประตูดึงปุ๊บเปิดปั๊บ
                  ครูที่ปรึกษา นายณัทพงศ์ โยธี หัวหน้าทีม นางสาวรำไพ คำศรี
                  <br />
                  คณะผู้บริหาร ครู บุคลากรทางการศึกษา วิทยาลัยเทคนิคกันทรลักษ์
                  #เทคนิคกันทร์ ชื่นชมยินดี ว่า “ผู้ที่ได้รับรางวัล
                  ได้พิจารณาคัดเลือกจากผลงาน เพื่อเชิดชูเกียรติ ยกย่อง สนับสนุน
                  ส่งเสริม สร้างขวัญกำลังใจ เป็นแบบอย่างที่ดี
                  ซึ่งผู้ได้รับรางวัลในครั้งนี้ ต่างผ่านการพิจารณามาโดยรอบคอบ
                  และแต่ละคนมีความเหมาะสมอย่างยิ่งต่อการได้รับรางวัล”
                  <br />
                  วันที่ ๒๗ พฤศกิกายน ๒๕๖๖
                </p>

                <div className=" justify-center flex-col ">
                  <div>
                    {Data19.map((Data19) => (
                      <div className="mb-4 group relative shadow-lg rounded-xl px-[144px] py-[144px]">
                        <div
                          className="absolute inset-0 bg-cover bg-center rounded-xl "
                          style={{
                            backgroundImage: `url(${Data19.img19})`,
                          }}
                        />
                      </div>
                    ))}
                  </div>
                </div>
              </>
            </Typography>
          </DialogBody>
          <DialogFooter>
            <Button variant="text" color="blue-gray" onClick={handleOpen}>
              ย้อนกลับ
            </Button>
          </DialogFooter>
        </Dialog>
      </div>
    </>
  );
}
